Autodesk.Revit.DB.ExclusionFilter.#ctor(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Constructs a new instance of a filter to exclude elements automatically.
idsToExclude:
The ids to exclude from the results.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input collection of ids was empty, or its contents were not valid for iteration.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011